{"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"output_dim": 500, "input_dtype": "float32", "trainable": true, "b_constraint": null, "activity_regularizer": null, "batch_input_shape": [null, 784], "b_regularizer": null, "bias": true, "input_dim": 784, "W_regularizer": null, "W_constraint": null, "name": "dense_1", "init": "glorot_uniform", "activation": "linear"}}, {"class_name": "Activation", "config": {"activation": "sigmoid", "trainable": true, "name": "activation_1"}}, {"class_name": "Dense", "config": {"output_dim": 500, "trainable": true, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "bias": true, "input_dim": null, "W_regularizer": null, "W_constraint": null, "name": "dense_2", "init": "glorot_uniform", "activation": "linear"}}, {"class_name": "Activation", "config": {"activation": "sigmoid", "trainable": true, "name": "activation_2"}}, {"class_name": "Dense", "config": {"output_dim": 10, "trainable": true, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "bias": true, "input_dim": null, "W_regularizer": null, "W_constraint": null, "name": "dense_3", "init": "glorot_uniform", "activation": "linear"}}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_3"}}], "keras_version": "1.0.7"}